export interface KarmicKnot {
  codes: number[][];
  description: string;
  lesson?: string;
}

export const karmicKnots: KarmicKnot[] = [
  {
    codes: [[18, 6, 6]],
    description:
      "Эта комбинация говорит о том, что в прошлой жизни вы занимались эзотерикой или магией. Это комбинация страхов. В прошлом вы могли совершать какие-то манипуляции по привлечению внимания или чувств человека — это могла быть чёрная магия, приворот, обман (например, про беременность) и прочее. Такой человек сильно зависит от любви и ему всегда её мало. С таким кодом он всю жизнь будет искать настоящую любовь и ему всегда будет казаться, что его не любят. Это постоянная смена партнёров: в каждых новых отношениях любви будет становиться всё меньше и меньше. Тут проявляется склонность к изменам, они сами притягивают изменщиков и обманщиков.",
    lesson:
      "Нужно научиться выстраивать гармоничные и долгосрочные отношения, даже если страшно и кажется, что вас не ценят и не любят. Важно их не разрушать, поменять своё мышление, научиться смотреть на проблемы в любви не как на конец света, а как на то, что нужно решить, сделать выводы и пройти для личного роста.",
  },
  {
    codes: [[18, 9, 9]],
    description:
      "Это код одиночества. Такой человек постоянно думает, что он совсем один, что у него никого нет и он никому не нужен. Он действительно очень часто остаётся один. Часто они начинают встречаться с кем-то только из страха остаться в одиночестве.",
    lesson:
      "Научиться оставаться наедине с собой и понять, что ты не одинок, а свободен. Пока человек не научится быть наедине с собой и кайфовать от этого состояния, для него вся Вселенная будет создавать реальность таким образом, чтобы он всегда оставался один.",
  },
  {
    codes: [[18, 11, 11]],
    description:
      "Похож на код 18–9–9, но тут речь идёт про агрессию. В жизни человека могут встречаться агрессоры, которые делают больно, из-за которых он постоянно страдает — они манипулируют/избивают. Если такие персонажи встречаются на жизненном пути, то после расставания такой человек часто остаётся один на долгие годы.",
  },
  {
    codes: [[9, 9, 18]],
    description:
      "История про эзотерику, занятия магией, особенно чёрной. Причём ранее он использовал это всё против интересов своих близких или знакомых.",
    lesson:
      "В этой жизни вам нужно обязательно искупить свою вину, служить на благо других, занимаясь эзотерикой. Ни в коем случае нельзя цепляться за отношения, держать партнёра возле себя и привязываться к нему с тотальным гиперконтролем.",
  },
  {
    codes: [[15, 5, 8]],
    description:
      "Код предательства любимого, связанного с сексом, с изменами и так далее. В этой жизни человек может быть противоположностью: бояться, что ему изменят, остерегаться предательства, при этом о себе будут мысли: «Я? Изменить? Что за бред? Я самый верный на свете!». Замкнутый круг не прервётся, и такого человека будут предавать всю его жизнь, пока он один раз не смирится и не простит.",
    lesson: "Основная отработка — смириться и простить предателя.",
  },
  {
    codes: [[15, 20, 5]],
    description:
      "Это истории про предательство своего рода, выгоду, алкоголизм, наркозависимость, многократные измены. Причём это не разовое действие, а перманентный образ жизни. В этой жизни может также появиться желание расслабиться, захотеть чего-то новенького и уйти в жёсткий загул.",
    lesson:
      "Ему нужно выстраивать отношения со своей семьёй и своим любимым человеком на доверии, прислушиваться к их советам, не отходить от семейных правил и традиций, научиться покоряться.",
  },
  {
    codes: [[18, 3, 12]],
    description:
      "Код людей, которые в прошлой жизни испытали физическое страдание, побои. В этой жизни могут столкнуться с патологиями с самого рождения. Часто они впадают в зависимость от людей или веществ. Это история про очень болезненные отношения.",
    lesson:
      "Освобождаться от уз своего пленника; не жертвовать своей жизнью, собой. Пока не прервать замкнутый круг и через силу не уйти из этих тяготеющих отношений — будет становиться только хуже и хуже.",
  },
  {
    codes: [[9, 15, 6]],
    description:
      "Код девушек лёгкого поведения/казанов и изменников, страстных развратных натур. Здесь человек ищет эмоции, страсть, их ему всегда мало.",
    lesson:
      "Важно не искушаться, не вестись на сексуальные игрища. Нельзя быть зависимым от сексуальных наслаждений и ни в коем случае нельзя изменять партнёру, предавать его.",
  },
  {
    codes: [[6, 17, 11]],
    description:
      "Человек ради отношений загубил всю свою жизнь. Недооценивал свои таланты, и в этой жизни ему будет всегда казаться, что он чего-то недостоин: счастливых отношений, любви, реализации себя. Он всегда будет соглашаться на меньшее.",
    lesson:
      "Верить в свои таланты; не жертвовать собой ради семьи; соглашаться на всё, что предлагает Вселенная, и не соглашаться на то, что мешает в реализации. Нельзя в этой жизни выбирать семью вопреки карьере.",
  },
  {
    codes: [
      [12, 19, 7],
      [7, 19, 12],
    ],
    description:
      "Человек с таким кодом в прошлой жизни воевал или калечил людей, вступал в драки, убивал. Он был очень агрессивным в семье, тиранил либо вообще оставил семью ради военных действий, страны и т. д. Такой код бывает и у тех, кто убил свою вторую половинку, избивал партнёра и прочее.",
    lesson:
      "Уделять время семье, контролировать свою агрессию; не выбирать политику (с командировками) и военную структуру. В текущем воплощении всё, что связано с отъездами, будет пагубно влиять на семью, если человек не будет соблюдать баланс.",
  },
  {
    codes: [[15, 8, 11]],
    description:
      "В прошлой жизни человек совершал избиения своего партнёра, вступал в драки, вёл себя агрессивно и безответственно по отношению к своему партнёру.",
    lesson:
      "В этом воплощении ему предстоит проработать умение выражать свои эмоции, а также выстроить гармоничные отношения, которые базируются на взаимопонимании.",
  },
  {
    codes: [[18, 6, 15]],
    description:
      "Порчи, сглазы, привороты — всё это имело место в вашей прошлой жизни. Этот код говорит про ведьм и серьёзную чёрную магию. Человек не просто пользовался такой услугой, а сам занимался этим. В этой жизни у него будет очень много искушений: сделать гадость другим, уйти в чёрную эзотерику.",
    lesson: "Нужно помогать другим людям, делиться с ними своими знаниями, быть на стороне света, ни в коем случае не делать подлостей.",
  },
  {
    codes: [[6, 20, 14]],
    description:
      "Код жертвы и тех, кого ограничивали в деньгах. Например, была финансовая зависимость от партнёра. Это связано и с родителями, и с партнёром, а в совокупности это даёт депрессию.",
    lesson: "В этой жизни ему очень важно выйти из этого состояния, не жертвовать собой никогда.",
  },
  {
    codes: [[21, 10, 7]],
    description:
      "Духовный код воина света, человека, который всегда за правоту. Он, как крестоносец, который воевал за свою религию, веру, своего Бога. Человек был не в доме, не в семье. С таким кодом он может биться в отношениях до последнего за то, кто прав, а кто виноват.",
    lesson: "В этом воплощении ему нужно сконцентрироваться именно на своей семье, не воевать со всеми вокруг, не доказывать свою правоту.",
  },
  {
    codes: [[5, 14, 19]],
    description:
      "Это код миллионера. Такие люди рождены, чтобы стать очень богатыми. В минусе это какой-то простой учитель, воспитатель, а в плюсе — человек, который впитывает знания, передаёт и создаёт свою команду, систему. Если этот код стоит у женщины, то все мужчины вокруг будут сильно от неё подзаряжаться.",
  },
  {
    codes: [[6, 5]],
    description:
      "Код красоты, уюта в доме, тепла. Эта история про очень хозяйственных людей, с которыми приятно проводить время. В этой жизни они обязательно должны реализовать себя.",
  },
  {
    codes: [[9, 6, 15]],
    description:
      "Этот код принадлежит людям, которые должны оставить после себя что-то: книгу, картину, какое-то произведение искусства. У такого человека исполняются все мечты, он очень сильно притягивает всё желаемое.",
    lesson: "Ему нельзя уходить в зависимости. Он обязан в этой жизни идти за своей мечтой и не бояться её реализовывать.",
  },
  {
    codes: [[9, 20, 11]],
    description:
      "Эта кармическая история говорит о том, что происходит вырождение рода человека и ему важно исправить ситуацию в данном воплощении.",
    lesson: "Он должен создать семью, родить и воспитать детей, продолжить свой род.",
  },
  {
    codes: [[10, 15, 5]],
    description:
      "Код духовного учителя, человека с высокой духовной миссией. Такой человек приходит в эту жизнь с естественной мудростью, а в течение жизни интересуется самыми глубинными вопросами, накапливает знания и обязательно должен передавать их другим людям.",
    lesson: "Не отказывайте в помощи или совете, если вас о нём просят.",
  },
  {
    codes: [[15, 21, 6]],
    description: "Код кутежников, гулящих людей.",
    lesson: "Чтобы трансформировать код в плюс, человеку важно работать над получением социального признания, популярности, статуса прославленной звезды.",
  },
  {
    codes: [[17, 5, 6]],
    description: "Код человека, который должен видеть красоту в этом мире и создавать её вокруг себя благодаря своему особенному видению и талантам.",
  },
  {
    codes: [[18, 5, 5]],
    description: "Код человека, который обладает магическими знаниями. Эти знания он должен привнести в мир.",
  },
  {
    codes: [[18, 7, 7]],
    description:
      "Может присутствовать страх работы, дороги. Человек может сомневаться в своей способности к реализации в этой жизни.",
    lesson: "Он должен защищать свои права, научиться быть духовным воином и жрецом.",
  },
  {
    codes: [[18, 8, 8]],
    description: "Человек, который не доверяет этому миру. Он во всём ищет обман и предательство, которых особенно боится.",
  },
  {
    codes: [[19, 7]],
    description:
      "Код, сулящий большой успех в деньгах. Он похож на код миллионера, но это о том, что человек будет богатым, только если будет работать, стремиться к деньгам.",
  },
  {
    codes: [[18, 10, 10]],
    description: "Страх довериться богу, высшим силам, плыть по течению.",
    lesson: "Человеку нужно отпустить тотальный гиперконтроль над этой жизнью и принять помощь извне.",
  },
  {
    codes: [[18, 11, 11]],
    description:
      "История про лишний вес и страх принять своё тело. У таких людей также может проявиться непринятие своих эзотерических способностей и тотальное недоверие им.",
    lesson: "Важно развивать интуицию и наполняться духовными знаниями.",
  },
  {
    codes: [[20, 3, 10]],
    description:
      "Человек сталкивается с тем, что сестра, мама, бабушка обманывают в роду, а в окружении его часто обманывают женщины.",
    lesson: "Важно проработать взаимоотношения с женским полом.",
  },
  {
    codes: [[13, 7, 20]],
    description: "Код, говорящий о переломах костей вследствие аварий, ДТП.",
    lesson: "Таким людям важно никогда не стоять на месте и всегда стремиться к своим целям.",
  },
];

export function formatKnotCode(codes: number[][]): string {
  return codes.map((c) => c.join("-")).join(" и ");
}
